{
  "name": "Süleyman Fatih",
  "sections": {
    "about": {
      "title": "Who Am I?",
      "content": "Hello! I'm Süleyman Fatih, a passionate professional in technology and design. I love developing myself in different disciplines and I'm open to learning new things in every project. I have extensive experience in systems management, network design, and graphic design."
    },
    "whatIDo": {
      "title": "What Do I Do?",
      "content": "I work in systems management, network design, and graphic design. I'm passionate about web technologies, apply modern design principles, and always look for solutions to increase efficiency. I love bringing together user experience and technical excellence."
    },
    "interests": {
      "title": "My Interests",
      "content": "Technology, design, photography, software development, and open source projects are my areas of interest. I love learning new things about Linux systems, cloud technologies, and UI/UX design. I value the combination of creativity and technical knowledge."
    }
  },
  "profile": {
    "photo": "./assets/img/profile-en.jpg",
    "title": "Systems & Design Specialist",
    "career": "10+ years experience delivering systems administration and graphic design projects."
  },
  "projects": [
    {
      "id": 1,
      "name": "Personal Blog Platform",
      "description": "A dynamic blog platform I developed using HTML5, CSS3, and Vanilla JavaScript. Responsive design and easy-to-manage content system.",
      "link": "https://github.com/suleyman-fatih"
    },
    {
      "id": 2,
      "name": "Portfolio Website",
      "description": "A modern and fully responsive website showcasing my work. Designed with SEO optimization and fast loading times.",
      "link": "https://github.com/suleyman-fatih"
    },
    {
      "id": 3,
      "name": "Technical Documentation Site",
      "description": "A comprehensive knowledge base with detailed articles and guides about systems management and network design.",
      "link": "https://github.com/suleyman-fatih",
      "youtube": "https://www.youtube.com/embed/dQw4w9WgXcQ",
      "url": "https://docs.example.com",
      "notes": "Comprehensive technical articles and guides"
    }
  ]
}
