{
  "name": "Süleyman Fatih",
  "sections": {
    "about": {
      "title": "Ben Kimim?",
      "content": "Merhaba! Ben Süleyman Fatih. Teknoloji ve tasarım alanında tutkulu bir profesyonelim. Farklı disiplinlerde kendimi geliştirmeyi severim ve her projede yeni şeyler öğrenmeye açığım. Sistem yönetimi, ağ tasarımı ve grafik tasarımda geniş tecrübem vardır."
    },
    "whatIDo": {
      "title": "Ne Yapıyorum?",
      "content": "Sistem yönetimi, ağ tasarımı ve grafik tasarım alanlarında çalışıyorum. Web teknolojilerine ilgi duyuyor, modern tasarım prensiplerini uyguluyorum ve her zaman verimliliği artıracak çözümler arıyorum. Kullanıcı deneyimi ve teknik mükemmelliği bir araya getirmeyi seviyorum."
    },
    "interests": {
      "title": "İlgi Alanlarım",
      "content": "Teknoloji, tasarım, fotoğrafçılık, yazılım geliştirme ve açık kaynak projeler benim ilgi alanlarım. Linux sistemleri, cloud teknolojileri ve UI/UX tasarımı hakkında yeni şeyler öğrenmeyi severim. Yaratıcılık ve teknik bilginin birleşimini değerli buluyorum."
    }
  },
  "profile": {
    "photo": "./assets/img/profile-tr.jpg",
    "title": "Sistem & Tasarım Uzmanı",
    "career": "10+ yıllık deneyimle sistem yönetimi ve grafik tasarım projelerinde çalıştım."
  },
  "projects": [
    {
      "id": 1,
      "name": "Kişisel Blog Platformu",
      "description": "HTML5, CSS3 ve Vanilla JavaScript kullanarak geliştirdiğim dinamik blog platformu. Responsive tasarım ve kolay yönetilebilir içerik sistemi.",
      "link": "https://github.com/suleyman-fatih"
    },
    {
      "id": 2,
      "name": "Portföy Web Sitesi",
      "description": "İşlerimizi sergilediğim modern ve tam responsive web sitesi. SEO optimizasyonu ve hızlı yükleme süresi ile tasarlanmıştır.",
      "link": "https://github.com/suleyman-fatih"
    },
    {
      "id": 3,
      "name": "Teknik Dokümantasyon Sitesi",
      "description": "Sistem yönetimi ve ağ tasarımı hakkında detaylı yazılar ve kılavuzlar içeren kapsamlı bir bilgi tabanı.",
      "link": "https://github.com/suleyman-fatih",
      "youtube": "https://www.youtube.com/embed/dQw4w9WgXcQ",
      "url": "https://docs.example.com",
      "notes": "Kapsamlı teknik makaleler ve rehberler"
    }
  ]
}
